Revit 2024 API
DWFImportOptions Constructor (DWFImportOptions)
 Constructs a new instance of DWFImportOptions as a copy of the import options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public DWFImportOptions(
	DWFImportOptions option
)
Visual Basic
Public Sub New ( _
	option As DWFImportOptions _
)
Visual C++
public:
DWFImportOptions(
	DWFImportOptions^ option
)
Parameters
option
Type: Autodesk.Revit.DB.DWFImportOptions
 The options to be copied.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DWFImportOptions Class
DWFImportOptions Overload
Autodesk.Revit.DB Namespace